[{"question": "I expect I’ll get reamed for this, but here it goes. For context, I am Gen X and consider myself substantially liberal. However, I find myself more than annoyed as every rude characteristic has now become a diagnosed disability. Time blindness with today’s technology and custom notifications going off every other minute, come on, I totally get, neurodivergence is a thing. I’m enmeshed in the autistic community and ADHD, anxiety and other mental illness are abundant. But must we make allowances for every misbehavior? I understand showing grace for those who truly cannot help themselves. But what about my right to not be insulted, not be stood up, or not have more work thrust upon me because of someone’s executive function disorder? I can’t help feeling how I feel. So, I guess my question is how do I get past these feelings? I hate feeling so ungenerous, but I also don’t want to walk on eggshells because I made a joke about the weather and someone is now having a meltdown. How should I reframe this to just let it go?"},
  {"question":"My boyfriend and I are both 31, nearly 32. When we got together we fell in love very quickly and he asked for my ring size about five weeks in—I said from day one I wanted to be married. We moved in together at seven months (just before the pandemic) and have been very happy together in our little one-bedroom flat since. He is very close with his family and I have no family at all and have always wanted a family to call my own (note: I don’t really want children, but I would like for my husband and myself to be a unit). Every time I bring up marriage he says, “It will happen” and he has a plan, but it has been nearly over three years now. I don’t care about a fancy ring or anything—he could spend $10 for all I care but we talked proposals very early on and I said I would like to be proposed to and he agreed. Should I push again in a few months, or just say I’ve had enough if he clearly isn’t going to commit?"},
  {"question":"My friend will occasionally tell me I’m a “messy girl.” She means messy as in someone who gets involved in complicated life situations. I admittedly have been a “messy girl” for most of my adult life, but a year and a half ago I got sober in a 12-step program and completely turned my life around. Part of my work included making amends to her for some of my past behavior. The other day, she said to me again, “You’re a messy girl.” When she says this, I feel judged, hurt, and unseen. My sobriety has allowed me to leave my messy days behind. I would also never dream of saying something like this to her even though I have seen her in some undoubtedly messy situations, because it feels mean. My question is how can I address this with her?"},
  {"question":"My priest is leaving the priesthood because he’s fallen in love with me. I don’t know what to do. I’m not a religious person, but after my father died, I became close with the priest who provided his last rites and ministered to us during the funeral. Over the past year, we grew close, and I started to think of him as a good friend. Last week, he gave me a letter and asked me to read it when I got home. In it, he confessed his feelings for me, that he no longer felt like a father in the ecclesiastical sense, and that he wanted to be with me in Holy Matrimony. I am shaken, confused, and feeling guilty. He’s already begun the process of being laicized, but I don’t share his feelings. He was shattered when I told him, even though if we were just co-workers and good friends, I would date him. But he wants to get married. I feel like everything is so fast and there’s so much pressure on the relationship, I wish he would have talked to me before deciding to leave the clergy. But he explained he needed to be released from his vows, otherwise, it would be like cheating. What should I do? What if this doesn’t work out? Would it be crazy to get engaged right now? I never even thought of him romantically before, but I know I can grow to love him."},
  {"question":"My partner of nearly 8 years (who’s 61) ogles young women half or more than half his age—sometimes doing a double-take or looking them up and down. It’s obvious, embarrassing, and disrespectful. He presents as a “dirty old man” or “creeper,” as young girls often call men that do the same. I’ve told him several times his actions are lewd, but he doesn’t change. Should I tolerate his tongue-hanging-out behavior or find a more respectful man?"},
  {"question":"I am a 54-year-old man about to celebrate my 20th wedding anniversary. I have two teen boys that do well in school, play sports, and generally seem happy and well-adjusted. The issue I am having has to do with friends. Before marriage, I was always very social and had tons of friends. My sons are always amazed at how when we are out, I always know people—both staff and customers—in restaurants, stores, museums, and just on the street. My wife is a bit more socially anxious than I am, but not debilitatingly so. However, just being busy with my kids and having had a father with dementia, and then the COVID social re-arrangement, I lost touch with some great friends, and many of them had similar issues. I am trying to reconnect, but am having some trouble with it. When I call or text my friends, they always reply or pick up and seem to enjoy talking to me, but very rarely, if ever, do any of them spontaneously text or call me. Similarly, if I ask friends to meet for lunch/dinner/concert/soccer match or just come by, they mostly say yes and we have a great time, but no one seems to ever invite me out or over.This is all hurting not only my confidence but also my feelings. I feel like I am generally not important enough for these people to remember to check in with me or more of a friend of convenience—as in a fine person to spend time with, as long as there is little effort involved. It makes me feel like I am imposing on these people and generally friendless and worse of all, that if I didn’t make the effort to contact them, they would just go on with their lives and never think about me again. Any advice on how I should deal with my feelings and/or how to deal with having friendships that are more reciprocal?"},
  {"question":"I (47 F) have been in a relationship with my boyfriend (50 M) for three years. I can make a long list of his good qualities and my teenage children really enjoy spending time with him on occasion. I’m going to get straight to the “but.” Although we have been together for three years, I see him sparingly, as I am a single mom to three great kids. I mainly spend a night or two with him every other weekend while the kids are with their dad. Thus, I don’t really have the opportunity to know what he is like on a day-to-day basis. I probably see him on his best behavior. But I’ve had reason to question some things about him. I think, but don’t know, that he drinks daily and probably too much. I expressed this concern to him and he basically said he would take it into consideration but I don’t see any change in his drinking. We have politically different views, which is fine with me, except his views are driven by anger and misinformation rather than logic and fact, such that I have had to tell him that we cannot discuss politics; we simply agree to disagree. Once, we were visiting some friends of his a few hours away and he got drunk and told me that he thought I was flirting with another man and didn’t want me coming home with him. I ended up walking by myself at night through a city I didn’t know and taking an Uber two hours home. Last weekend, we drove a few hours to stay at the beach and once each on the way there and the way back, he had an instance of road rage so severe that he was driving alongside the other car screaming and gesturing. I felt so upset and unsafe. And I can’t stop thinking that he has jeopardized my safety on multiple occasions now. But the instances are few and far between, and so out of line with everything else I know about him, so I end up letting them go. So, I am three years invested in this relationship. I feel like I would tell anyone else that this guy obviously has some issues and they should move on, but I have spent my whole life finding ways to justify and excuse others’ bad behavior—it’s my superpower and my kryptonite!—so I’m not confident about what to do here. I feel stuck and not sure which part of myself to trust."},
  {"question":"My bestie and her husband retired from Jersey to the Boston area about four years ago. Since retiring, her husband has become a “Velcro strip” (my term) and does not ever leave her side. She never has any time alone or to herself as he involves himself in every aspect of her life now. In the past, he was a successful businessperson who ran his own hedge fund and certainly spent time without her. She and I always spent time alone together and in fact, I can’t ever remember a time when we included him! I barely knew the guy! The problem is that now when I go to visit her we can’t have a minute alone without him being literally attached at the hip to her. The first couple of visits I didn’t say anything but then I realized that besides the inserting of himself between us, he was also very verbally abusive to her. I believe he may have always been like this and I never realized it because when she lived here I rarely saw him. Anyway, to make a long story short this last visit was more than I could take. I finally opened my mouth and let him have it! My friend wasn’t standing up to him but I wasn’t going to take his BS. He basically ignored me and she never even mentioned the incident. How should I proceed? I have decided that I will not go up there to visit any longer because it’s so uncomfortable to always have to be with him when I would just like some time alone with her. I am not sure if I should tell her how I feel because I know how hurt she will be. I guess I will just make excuses for why I can not come to visit. Please help!"},
  {"question":"My friend has always been delighted that she had a “rom-com” relationship. After being a bit of a wallflower in school and not very successful dating as an adult, she ran into an old schoolmate at our reunion and had a whirlwind courtship, marriage, and stepkids. I was recently told by someone that her husband had been burned by his (beautiful/popular/outgoing) ex and had told them at the reunion that he was going to “settle” for my friend when he saw her. The rationale, apparently, was she would be grateful, he would be comfortable, and the kids would be taken care of when with them. I didn’t want to know any of this, but now it is all I can think about when I am with my friend and she talks about her wonderful husband, his awful ex, and her bratty stepkids. I don’t think there is anything to be gained by telling her (for a start, it might not be true! Or it started out true and her husband did fall madly for her), but how do I stop thinking about it all the time? It is hard to avoid the topic, and I admit that after a few years of “Oh, you should have a meet-cute like mine,” I was already a bit sour on the topic."},
  {"question":"I have TSA PreCheck through my job. When my wife and I travel together, is it rude for me to use the PreCheck line? She thinks I should go through the standard security line with her. I think it makes more sense for me to use the PreCheck line. If I get through security faster, I can get us a spot at the gate or a table at a restaurant while she’s still in line. What say you?"},
  {"question":"I’m a single mom of two (6 and 8), and my boyfriend of a year and a half opened up to me that he thinks I have great kids, but he doesn’t enjoy spending time with them. He’s great with them and does things with us out of love for me. We were about to move in together until he told me this. I’m glad he told me, but now I’m hesitant. Is this normal? If we were to continue, is this a relationship bound for resentment and failure?"},
  {"question":"Just imagine working in an office and having someone copying everything you wear. This person is my co-worker, who sits next to me. We are medical professionals and see the same patients. She comes from a rural area and wanted to fit in. That’s fine, but she has started to copy me. It’s not flattering, it’s plain irritating. She just goes and buys the same sweaters and shoes that I wear; she got the same haircut from my hairdresser too. How do you deal with a colleague who imitates you to this extent? I’ve stopped sharing the details of my clothes, but she now knows where I shop and what I buy and already owns everything that I wear, so some days we are twinning. I have to work and deal with this person daily, and even though I’m trying to maintain a distance, it’s just making her more clingy. Now, she’s calling and texting me desperately, trying to keep a friendship. Would really like your expert thoughts on how to handle this."},
  {"question":"I feel really strongly about a family dynamic I’m experiencing, but I am starting to sense that I might be in the wrong. My brother and I (both adults) grew up in a complicated household with an alcoholic parent. During that time, I became the scapegoat for a lot of things I, only years later (and with considerable therapy), realized I didn’t deserve. My younger brother witnessed the anger my parents directed toward me, and began treating me similarly. This has continued into our adulthood. Now, two decades later, I am struggling with how to maintain both a relationship with my family and my own mental well-being. My brother treats me with frequent condescension and rudeness, and when I bring this up to him, he tells me I’m being overly sensitive. My mom has witnessed some of these interactions and tells me “he’s in a dark place right now, we just need to give him grace,” or “that’s just his sense of humor.” As a concrete example, last year I invited my brother to spend a holiday with my family. He responded, “why on earth would I want to do that?” I shared that the response made me sad and that it was a missed opportunity to spend time with my kids, his nephews. My mom and aunt told me his response was a hilarious joke and that I was overreacting. I’m feeling entirely unsupported by my family, but I also can’t define exactly what I’m asking of them. When I suggest that someone could step in when they witness my brother treating me unkindly, I’m told that we are adults and it’s between us … which is true! But when I say I’d rather not invite him to a family function I’m hosting, I’m told that I need to be more inclusive and more patient. Somehow, I’m coming off looking like the bad guy in either case, and I’m to the point where I fantasize about telling my entire family to hit the road and stop calling me. Can you point me in the right direction here? How can I avoid my brother’s meanness and—more importantly—how can I lessen the resentment I feel toward the rest of my family’s look-the-other-way attitude?"},
  {"question":"I (M22) am a school teacher who can’t seem to get a date. My roommate (M26) is just about the only fun person I know. Even though he’s still in med school, he manages to drink everyone under the table, go swimming every morning, and be the life of every party. He’s basically the only cool thing in my life, although sometimes annoying to be around. I finally have the opportunity to move out. An older friend (M38), who is finally leaving his cheating wife, has offered me a room at his place. In a lot of ways, I think this is a better situation given my personality, but I’m afraid that leaving now will cheat me out of a good time while I’m young. What should I do?"},
  {"question":"A friend of mine in my city used to ask me to cat-sit for her. The cat was very sweet and had a gravity feeder, so it initially started off as low-key check-ins every couple of days during a couple of annual trips. Over time, this evolved into checking in on the cat every day, with picture updates, during 5-6 trips per year, some of which lasted weeks. My friend also went from thanking me with a nice bottle of wine for helping out, to basically presuming I would always help her out without thanks. I was getting kind of sick of the amount of time and effort being asked of me, and was beginning to push back on cat sitting requests, when the cat died suddenly last year. My friend was devastated and took it hard, especially since she lives alone. Now she’s looking at getting another cat, and already openly discussing ways to lasso in free help from other people in watching the cat. She says she does not want to ever pay for pet sitting because she thinks it’s too pricey. I know I need to talk to her, so the question is: Do I have a chat with her BEFORE she gets the new cat, or wait until the requests start rolling in?"},
{"question":"My three children have given birth four times among them. At each birth, the labor was “attended” by a bunch of groupies – mothers, fathers, mothers-in-law, sisters, friends, etc. Also the husband – possibly lost in the crowd. In each case I refused to participate in these mob vigils. During the course of the proceedings a constant string of text updates and comments were issued. In each case I refused to participate and announced that I would stay home and await the traditional phone call. One time, the birth was announced with only a text! I told everyone that I regarded a birth as a solemn, intimate and very private event for the new parents. They thought I was goofy. Are people live streaming their labor on Facebook yet?! – Disgruntled Grannie"}]
